<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | درج ذیل زبان کی سطریں توثیق کے دوران مختلف پیغامات کے لیے استعمال ہوتی ہیں
    | جو ہمیں صارف کو دکھانے کی ضرورت ہوتی ہے۔ آپ ان زبان کی سطروں کو اپنی درخواست
    | کی ضروریات کے مطابق ترمیم کر سکتے ہیں۔
    |
    */

    'failed' => 'یہ اسناد ہمارے ریکارڈ سے مطابقت نہیں رکھتیں۔',
    'throttle' => 'لاگ ان کرنے کی بہت زیادہ کوششیں کی گئی ہیں۔ براہ کرم :seconds سیکنڈ میں دوبارہ کوشش کریں۔',

];

