<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Password Reset Language Lines
    |--------------------------------------------------------------------------
    |
    | درج ذیل زبان کی سطریں وہ ڈیفالٹ لائنیں ہیں جو پاس ورڈ اپڈیٹ کرنے کی
    | کوشش کے لیے دی گئی وجوہات سے ملتی ہیں، جیسے کہ غلط ٹوکن یا نیا
    | پاس ورڈ۔
    |
    */

    'reset' => 'آپ کا پاس ورڈ دوبارہ ترتیب دیا گیا ہے!',
    'sent' => 'ہم نے آپ کے پاس ورڈ ری سیٹ کرنے کا لنک ای میل کر دیا ہے!',
    'throttled' => 'براہ کرم دوبارہ کوشش کرنے سے پہلے انتظار کریں۔',
    'token' => 'یہ پاس ورڈ ری سیٹ کرنے کا ٹوکن غلط ہے۔',
    'user' => "ہم اس ای میل پتے کے ساتھ کوئی صارف نہیں پا سکتے۔",

];

